{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "edf41bc9",
   "metadata": {},
   "source": [
    "Задача: Определение победителя теста по Python с сортировкой результатов\n",
    "Егор участвовал в тестировании по Python и хочет узнать, является ли его результат лучшим в группе. Кроме этого, он хочет увидеть список всех участников с их баллами, отсортированный в порядке возрастания баллов.\n",
    "Напишите программу, которая поможет Егору определить, занял ли он первое место, и выведет упорядоченные результаты.\n",
    "Входные данные\n",
    "Каждая строка содержит информацию об одном участнике в следующем формате:\n",
    "<Фамилия> <Количество_баллов>\n",
    " • <Фамилия> — фамилия участника (строка).\n",
    " • <Количество_баллов> — итоговый балл участника (целое число).\n",
    " Выходные данные\n",
    " 1. Выведите YES, если Егор набрал наибольшее количество баллов в группе, или NO, если кто-то набрал больше.\n",
    " 2. Затем выведите список участников и их баллы, отсортированный в порядке возрастания баллов."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "032da825",
   "metadata": {},
   "outputs": [],
   "source": [
    "Решение\n",
    "python\n",
    "def analyze_test_results(input_data):\n",
    "    scores = []\n",
    "    egor_score = -1\n",
    "\n",
    "    # Обработка входных данных\n",
    "    for line in input_data:\n",
    "        name, score = line.split()\n",
    "        score = int(score)\n",
    "        scores.append((name, score))\n",
    "        if name == \"Егор\":\n",
    "            egor_score = score\n",
    "\n",
    "    # Сортировка по возрастанию баллов\n",
    "    scores.sort(key=lambda x: x[1])\n",
    "\n",
    "    # Проверка, является ли Егор лучшим\n",
    "    max_score = max(scores, key=lambda x: x[1])[1]\n",
    "    is_egor_top = \"YES\" if egor_score == max_score else \"NO\"\n",
    "\n",
    "    # Вывод результата\n",
    "    print(is_egor_top)\n",
    "    for name, score in scores:\n",
    "        print(name, score)\n",
    "\n",
    "# Пример использования\n",
    "input_data = [\n",
    "    \"Егор 85\",\n",
    "    \"Петя 90\",\n",
    "    \"Саша 78\",\n",
    "    \"Коля 85\"\n",
    "]\n",
    "analyze_test_results(input_data)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "da9b8000",
   "metadata": {},
   "source": [
    "Примеры\n",
    "Пример 1\n",
    "Входные данные:\n",
    "\n",
    "Егор 85\n",
    "Петя 90\n",
    "Саша 78\n",
    "Коля 85\n",
    "Вывод:\n",
    "objective \n",
    "\n",
    "NO\n",
    "Саша 78\n",
    "Егор 85\n",
    "Коля 85\n",
    "Петя 90\n",
    "Пример 2\n",
    "Входные данны\n",
    "Егор 90\n",
    "Петя 70\n",
    "Саша 89\n",
    "Коля 10\n",
    "Вывод:\n",
    "objectivec\n",
    "\n",
    "YES\n",
    "Коля 10\n",
    "Петя 70\n",
    "Саша 89\n",
    "Егор 90"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1bcde7f5",
   "metadata": {},
   "source": [
    "Задача: Поиск и подчеркивание ключевого слова в текстах  \n",
    "\n",
    "Напишите программу, которая принимает два текста и одно ключевое слово. Программа должна:  \n",
    "1. Вывести оба текста с подчеркнутыми (в виде `**ключевое слово**`) вхождениями ключевого слова.  \n",
    "2. Если в тексте ключевое слово не найдено, вывести вместо текста строку: `НЕТУ`.  \n",
    "\n",
    "---\n",
    "\n",
    "Входные данные  \n",
    "1. Первый текст.  \n",
    "2. Второй текст.  \n",
    "3. Ключевое слово (строка).  \n",
    "\n",
    "Выходные данные  \n",
    "1. Первый текст с подчеркнутым ключевым словом или НЕТУ, если слово отсутствует.  \n",
    "2. Второй текст с подчеркнутым ключевым словом или НЕТУ, если слово отсутствует.  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a9cf10e5",
   "metadata": {},
   "outputs": [],
   "source": [
    "def highlight_keyword(text1, text2, keyword):\n",
    "    def process_text(text, keyword):\n",
    "        # Проверяем, есть ли ключевое слово в тексте\n",
    "        if keyword in text:\n",
    "            # Подчеркиваем все вхождения ключевого слова\n",
    "            highlighted_text = text.replace(keyword, f\"**{keyword}**\")\n",
    "            return highlighted_text\n",
    "        else:\n",
    "            return \"НЕТУ\"\n",
    "\n",
    "    # Обрабатываем оба текста\n",
    "    result1 = process_text(text1, keyword)\n",
    "    result2 = process_text(text2, keyword)\n",
    "\n",
    "    # Вывод результатов\n",
    "    print(result1)\n",
    "    print(result2)\n",
    "\n",
    "# Пример использования\n",
    "text1 = input(\"Введите первый текст: \")\n",
    "text2 = input(\"Введите второй текст: \")\n",
    "keyword = input(\"Введите ключевое слово: \")\n",
    "\n",
    "highlight_keyword(text1, text2, keyword)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f6b7d594",
   "metadata": {},
   "source": [
    "Примеры\n",
    "Пример 1\n",
    "Входные данные:\n",
    "\n",
    "Первый текст: В лесу родилась елочка.  \n",
    "Второй текст: Елочка росла в лесу.  \n",
    "Ключевое слово: елочка  \n",
    "Вывод:\n",
    "\n",
    "\n",
    "В лесу родилась **елочка**. \n",
    "**елочка ** росла в лесу.  \n",
    "Пример 2\n",
    "Входные данные:\n",
    "\n",
    "Первый текст: В лесу родилась елочка.  \n",
    "Второй текст: Елочка росла в лесу.  \n",
    "Ключевое слово: снежинка  \n",
    "Вывод:\n",
    "\n",
    "\n",
    "НЕТУ  \n",
    "НЕТУ  \n",
    "Пример 3\n",
    "Входные данные:\n",
    "\n",
    "Первый текст: В лесу была тишина.  \n",
    "Второй текст: Тишина окружала весь лес.  \n",
    "Ключевое слово: лес  \n",
    "Вывод:\n",
    "\n",
    "\n",
    "В: снежинкабыла тишина.  \n",
    "Тишина окружала весь **лес**."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
